===
bool_type
===
type some = bool
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (bool_type)))))
===
int_type
===
type some = int(32)
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (int_type
          (expression
            (constant_expression
              (litteral
                (integer)))))))))
===
card_type
===
type some = card(64)
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (card_type
          (expression
            (constant_expression
              (litteral
                (integer)))))))))
===
fix_type
===
type some = fix(16, 16)
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (fix_type
          (expression
            (constant_expression
              (litteral
                (integer))))
          (expression
            (constant_expression
              (litteral
                (integer)))))))))
===
float_type
===
type some = float(23, 8)
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (float_type
          (expression
            (constant_expression
              (litteral
                (integer))))
          (expression
            (constant_expression
              (litteral
                (integer)))))))))
===
range_type
===
type some = [0..10]
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (range_type
          (expression
            (constant_expression
              (litteral
                (integer))))
          (expression
            (constant_expression
              (litteral
                (integer)))))))))
===
enum_type - empty
===
type some = enum()
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (enum_type
          (enum_value
            (expression
              (reference_expression
                (MISSING identifier)))))))))
===
enum_type - num
===
type some = enum(1)
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (enum_type
          (enum_value
            (expression
              (constant_expression
                (litteral
                  (integer))))))))))
===
enum_type - num, range, num
===
type some = enum(1, 2..3, 4)
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (enum_type
          (enum_value
            (expression
              (constant_expression
                (litteral
                  (integer)))))
          (enum_value
            (expression
              (constant_expression
                (litteral
                  (integer))))
            (expression
              (constant_expression
                (litteral
                  (integer)))))
          (enum_value
            (expression
              (constant_expression
                (litteral
                  (integer))))))))))
===
named_type
===
type some = some_other
---
(top_level
  (specification
    (type_specification
      (identifier)
      (type_expression
        (named_type
          (identifier))))))
